espressif/esp-idf/components/soc/esp32h21/register/soc/spi_mem_c_struct.h
/** Group: External RAM timing registers */
/** Type of smem_timing_cali register
 *  MSPI external RAM timing calibration register
 */
typedef union {
    struct {
        /** smem_timing_clk_ena : HRO; bitpos: [0]; default: 1;
         *  For sram, the bit is used to enable timing adjust clock for all reading operations.
         */
        uint32_t smem_timing_clk_ena:1;
        /** smem_timing_cali : HRO; bitpos: [1]; default: 0;
         *  For sram, the bit is used to enable timing auto-calibration for all reading
         *  operations.
         */
        uint32_t smem_timing_cali:1;
        /** smem_extra_dummy_cyclelen : HRO; bitpos: [4:2]; default: 0;
         *  For sram, add extra dummy spi clock cycle length for spi clock calibration.
         */
        uint32_t smem_extra_dummy_cyclelen:3;
        /** smem_dll_timing_cali : HRO; bitpos: [5]; default: 0;
         *  Set this bit to enable DLL for timing calibration in DDR mode when accessed to
         *  EXT_RAM.
         */
        uint32_t smem_dll_timing_cali:1;
        uint32_t reserved_6:1;
        /** smem_dqs0_270_sel : HRO; bitpos: [8:7]; default: 1;
         *  Set these bits to delay dqs signal & invert delayed signal for DLL timing adjust.
         *  2'd0: 0.5ns, 2'd1: 1.0ns, 2'd2: 1.5ns 2'd3: 2.0ns.
         */
        uint32_t smem_dqs0_270_sel:2;
        /** smem_dqs0_90_sel : HRO; bitpos: [10:9]; default: 1;
         *  Set these bits to delay dqs signal for DLL timing adjust. 2'd0: 0.5ns, 2'd1: 1.0ns,
         *  2'd2: 1.5ns 2'd3: 2.0ns.
         */
        uint32_t smem_dqs0_90_sel:2;
        uint32_t reserved_11:21;
    };
    uint32_t val;
} spi_smem_timing_cali_reg_t;

/** Type of smem_din_mode register
 *  MSPI external RAM input timing delay mode control register
 */
typedef union {
    struct {
        /** smem_din0_mode : HRO; bitpos: [2:0]; default: 0;
         *  the input signals are delayed by system clock cycles, 0: input without delayed, 1:
         *  input with the posedge of clk_apb,2 input with the negedge of clk_apb,  3: input
         *  with the posedge of clk_160, 4 input with the negedge of clk_160, 5: input with the
         *  spi_clk high edge,  6: input with the spi_clk low edge
         */
        uint32_t smem_din0_mode:3;
        /** smem_din1_mode : HRO; bitpos: [5:3]; default: 0;
         *  the input signals are delayed by system clock cycles, 0: input without delayed, 1:
         *  input with the posedge of clk_apb,2 input with the negedge of clk_apb,  3: input
         *  with the posedge of clk_160, 4 input with the negedge of clk_160, 5: input with the
         *  spi_clk high edge,  6: input with the spi_clk low edge
         */
        uint32_t smem_din1_mode:3;
        /** smem_din2_mode : HRO; bitpos: [8:6]; default: 0;
         *  the input signals are delayed by system clock cycles, 0: input without delayed, 1:
         *  input with the posedge of clk_apb,2 input with the negedge of clk_apb,  3: input
         *  with the posedge of clk_160, 4 input with the negedge of clk_160, 5: input with the
         *  spi_clk high edge,  6: input with the spi_clk low edge
         */
        uint32_t smem_din2_mode:3;
        /** smem_din3_mode : HRO; bitpos: [11:9]; default: 0;
         *  the input signals are delayed by system clock cycles, 0: input without delayed, 1:
         *  input with the posedge of clk_apb,2 input with the negedge of clk_apb,  3: input
         *  with the posedge of clk_160, 4 input with the negedge of clk_160, 5: input with the
         *  spi_clk high edge,  6: input with the spi_clk low edge
         */
        uint32_t smem_din3_mode:3;
        /** smem_din4_mode : HRO; bitpos: [14:12]; default: 0;
         *  the input signals are delayed by system clock cycles, 0: input without delayed, 1:
         *  input with the posedge of clk_apb,2 input with the negedge of clk_apb,  3: input
         *  with the posedge of clk_160, 4 input with the negedge of clk_160, 5: input with the
         *  spi_clk high edge,  6: input with the spi_clk low edge
         */
        uint32_t smem_din4_mode:3;
        /** smem_din5_mode : HRO; bitpos: [17:15]; default: 0;
         *  the input signals are delayed by system clock cycles, 0: input without delayed, 1:
         *  input with the posedge of clk_apb,2 input with the negedge of clk_apb,  3: input
         *  with the posedge of clk_160, 4 input with the negedge of clk_160, 5: input with the
         *  spi_clk high edge,  6: input with the spi_clk low edge
         */
        uint32_t smem_din5_mode:3;
        /** smem_din6_mode : HRO; bitpos: [20:18]; default: 0;
         *  the input signals are delayed by system clock cycles, 0: input without delayed, 1:
         *  input with the posedge of clk_apb,2 input with the negedge of clk_apb,  3: input
         *  with the posedge of clk_160, 4 input with the negedge of clk_160, 5: input with the
         *  spi_clk high edge,  6: input with the spi_clk low edge
         */
        uint32_t smem_din6_mode:3;
        /** smem_din7_mode : HRO; bitpos: [23:21]; default: 0;
         *  the input signals are delayed by system clock cycles, 0: input without delayed, 1:
         *  input with the posedge of clk_apb,2 input with the negedge of clk_apb,  3: input
         *  with the posedge of clk_160, 4 input with the negedge of clk_160, 5: input with the
         *  spi_clk high edge,  6: input with the spi_clk low edge
         */
        uint32_t smem_din7_mode:3;
        /** smem_dins_mode : HRO; bitpos: [26:24]; default: 0;
         *  the input signals are delayed by system clock cycles, 0: input without delayed, 1:
         *  input with the posedge of clk_apb,2 input with the negedge of clk_apb,  3: input
         *  with the posedge of clk_160, 4 input with the negedge of clk_160, 5: input with the
         *  spi_clk high edge,  6: input with the spi_clk low edge
         */
        uint32_t smem_dins_mode:3;
        uint32_t reserved_27:5;
    };
    uint32_t val;
} spi_smem_din_mode_reg_t;

/** Type of smem_din_num register
 *  MSPI external RAM input timing delay number control register
 */
typedef union {
    struct {
        /** smem_din0_num : HRO; bitpos: [1:0]; default: 0;
         *  the input signals are delayed by system clock cycles, 0: delayed by 1 cycle, 1:
         *  delayed by 2 cycles,...
         */
        uint32_t smem_din0_num:2;
        /** smem_din1_num : HRO; bitpos: [3:2]; default: 0;
         *  the input signals are delayed by system clock cycles, 0: delayed by 1 cycle, 1:
         *  delayed by 2 cycles,...
         */
        uint32_t smem_din1_num:2;
        /** smem_din2_num : HRO; bitpos: [5:4]; default: 0;
         *  the input signals are delayed by system clock cycles, 0: delayed by 1 cycle, 1:
         *  delayed by 2 cycles,...
         */
        uint32_t smem_din2_num:2;
        /** smem_din3_num : HRO; bitpos: [7:6]; default: 0;
         *  the input signals are delayed by system clock cycles, 0: delayed by 1 cycle, 1:
         *  delayed by 2 cycles,...
         */
        uint32_t smem_din3_num:2;
        /** smem_din4_num : HRO; bitpos: [9:8]; default: 0;
         *  the input signals are delayed by system clock cycles, 0: delayed by 1 cycle, 1:
         *  delayed by 2 cycles,...
         */
        uint32_t smem_din4_num:2;
        /** smem_din5_num : HRO; bitpos: [11:10]; default: 0;
         *  the input signals are delayed by system clock cycles, 0: delayed by 1 cycle, 1:
         *  delayed by 2 cycles,...
         */
        uint32_t smem_din5_num:2;
        /** smem_din6_num : HRO; bitpos: [13:12]; default: 0;
         *  the input signals are delayed by system clock cycles, 0: delayed by 1 cycle, 1:
         *  delayed by 2 cycles,...
         */
        uint32_t smem_din6_num:2;
        /** smem_din7_num : HRO; bitpos: [15:14]; default: 0;
         *  the input signals are delayed by system clock cycles, 0: delayed by 1 cycle, 1:
         *  delayed by 2 cycles,...
         */
        uint32_t smem_din7_num:2;
        /** smem_dins_num : HRO; bitpos: [17:16]; default: 0;
         *  the input signals are delayed by system clock cycles, 0: delayed by 1 cycle, 1:
         *  delayed by 2 cycles,...
         */
        uint32_t smem_dins_num:2;
        uint32_t reserved_18:14;
    };
    uint32_t val;
} spi_smem_din_num_reg_t;

/** Type of smem_dout_mode register
 *  MSPI external RAM output timing adjustment control register
 */
typedef union {
    struct {
        /** smem_dout0_mode : HRO; bitpos: [0]; default: 0;
         *  the output signals are delayed by system clock cycles, 0: output without delayed,
         *  1: output with the posedge of clk_apb,2 output with the negedge of clk_apb, 3:
         *  output with the posedge of clk_160,4 output with the negedge of clk_160,5: output
         *  with the spi_clk high edge ,6: output with the spi_clk low edge
         */
        uint32_t smem_dout0_mode:1;
        /** smem_dout1_mode : HRO; bitpos: [1]; default: 0;
         *  the output signals are delayed by system clock cycles, 0: output without delayed,
         *  1: output with the posedge of clk_apb,2 output with the negedge of clk_apb, 3:
         *  output with the posedge of clk_160,4 output with the negedge of clk_160,5: output
         *  with the spi_clk high edge ,6: output with the spi_clk low edge
         */
        uint32_t smem_dout1_mode:1;
        /** smem_dout2_mode : HRO; bitpos: [2]; default: 0;
         *  the output signals are delayed by system clock cycles, 0: output without delayed,
         *  1: output with the posedge of clk_apb,2 output with the negedge of clk_apb, 3:
         *  output with the posedge of clk_160,4 output with the negedge of clk_160,5: output
         *  with the spi_clk high edge ,6: output with the spi_clk low edge
         */
        uint32_t smem_dout2_mode:1;
        /** smem_dout3_mode : HRO; bitpos: [3]; default: 0;
         *  the output signals are delayed by system clock cycles, 0: output without delayed,
         *  1: output with the posedge of clk_apb,2 output with the negedge of clk_apb, 3:
         *  output with the posedge of clk_160,4 output with the negedge of clk_160,5: output
         *  with the spi_clk high edge ,6: output with the spi_clk low edge
         */
        uint32_t smem_dout3_mode:1;
        /** smem_dout4_mode : HRO; bitpos: [4]; default: 0;
         *  the output signals are delayed by system clock cycles, 0: output without delayed,
         *  1: output with the posedge of clk_apb,2 output with the negedge of clk_apb, 3:
         *  output with the posedge of clk_160,4 output with the negedge of clk_160,5: output
         *  with the spi_clk high edge ,6: output with the spi_clk low edge
         */
        uint32_t smem_dout4_mode:1;
        /** smem_dout5_mode : HRO; bitpos: [5]; default: 0;
         *  the output signals are delayed by system clock cycles, 0: output without delayed,
         *  1: output with the posedge of clk_apb,2 output with the negedge of clk_apb, 3:
         *  output with the posedge of clk_160,4 output with the negedge of clk_160,5: output
         *  with the spi_clk high edge ,6: output with the spi_clk low edge
         */
        uint32_t smem_dout5_mode:1;
        /** smem_dout6_mode : HRO; bitpos: [6]; default: 0;
         *  the output signals are delayed by system clock cycles, 0: output without delayed,
         *  1: output with the posedge of clk_apb,2 output with the negedge of clk_apb, 3:
         *  output with the posedge of clk_160,4 output with the negedge of clk_160,5: output
         *  with the spi_clk high edge ,6: output with the spi_clk low edge
         */
        uint32_t smem_dout6_mode:1;
        /** smem_dout7_mode : HRO; bitpos: [7]; default: 0;
         *  the output signals are delayed by system clock cycles, 0: output without delayed,
         *  1: output with the posedge of clk_apb,2 output with the negedge of clk_apb, 3:
         *  output with the posedge of clk_160,4 output with the negedge of clk_160,5: output
         *  with the spi_clk high edge ,6: output with the spi_clk low edge
         */
        uint32_t smem_dout7_mode:1;
        /** smem_douts_mode : HRO; bitpos: [8]; default: 0;
         *  the output signals are delayed by system clock cycles, 0: output without delayed,
         *  1: output with the posedge of clk_apb,2 output with the negedge of clk_apb, 3:
         *  output with the posedge of clk_160,4 output with the negedge of clk_160,5: output
         *  with the spi_clk high edge ,6: output with the spi_clk low edge
         */
        uint32_t smem_douts_mode:1;
        uint32_t reserved_9:23;
    };
    uint32_t val;
} spi_smem_dout_mode_reg_t;


/** Group: NAND FLASH control and status registers */
/** Type of mem_nand_flash_en register
 *  NAND FLASH control register
 */
typedef union {
    struct {
        /** mem_nand_flash_en : HRO; bitpos: [0]; default: 0;
         *  NAND FLASH function enable signal. 1: Enable NAND FLASH, Disable NOR FLASH. 0:
         *  Disable NAND FLASH, Enable NOR FLASH.
         */
        uint32_t mem_nand_flash_en:1;
        /** mem_nand_flash_seq_hd_index : HRO; bitpos: [15:1]; default: 32767;
         *  NAND FLASH spi seq head index configure register. Every 5 bits represent  the 1st
         *  index of a SPI CMD sequence.[14:10]:usr; [9:5]:axi_rd; [4:0]:axi_wr.
         */
        uint32_t mem_nand_flash_seq_hd_index:15;
        /** mem_nand_flash_seq_usr_trig : HRO; bitpos: [16]; default: 0;
         *  NAND FLASH spi seq user trigger configure register. spi_mem_c_NAND_FLASH_SEQ_USR_TRIG
         *  is corresponds to spi_mem_c_NAND_FLASH_SEQ_HD_INDEX[14:10].1: enable 0: disable.
         */
        uint32_t mem_nand_flash_seq_usr_trig:1;
        /** mem_nand_flash_lut_en : HRO; bitpos: [17]; default: 0;
         *  NAND FLASH spi seq & cmd lut cfg en. 1: enable 0: disable.
         */
        uint32_t mem_nand_flash_lut_en:1;
        /** mem_nand_flash_seq_usr_wend : HRO; bitpos: [18]; default: 0;
         *  Used with spi_mem_c_NAND_FLASH_SEQ_USR_TRIG to indicate the last page program ,and to
         *  execute page execute. 1: write end 0: write in a page size.
         */
        uint32_t mem_nand_flash_seq_usr_wend:1;
        uint32_t reserved_19:13;
    };
    uint32_t val;
} spi_mem_c_nand_flash_en_reg_t;

/** Type of mem_nand_flash_sr_addr0 register
 *  NAND FLASH SPI SEQ control register
 */
typedef union {
    struct {
        /** mem_nand_flash_sr_addr0 : HRO; bitpos: [7:0]; default: 0;
         *  configure state register address for SPI SEQ need. If OIP is in address C0H , user
         *  could configure C0H into this register
         */
        uint32_t mem_nand_flash_sr_addr0:8;
        /** mem_nand_flash_sr_addr1 : HRO; bitpos: [15:8]; default: 0;
         *  configure state register address for SPI SEQ need. If OIP is in address C0H , user
         *  could configure C0H into this register
         */
        uint32_t mem_nand_flash_sr_addr1:8;
        /** mem_nand_flash_sr_addr2 : HRO; bitpos: [23:16]; default: 0;
         *  configure state register address for SPI SEQ need. If OIP is in address C0H , user
         *  could configure C0H into this register
         */
        uint32_t mem_nand_flash_sr_addr2:8;
        /** mem_nand_flash_sr_addr3 : HRO; bitpos: [31:24]; default: 0;
         *  configure state register address for SPI SEQ need. If OIP is in address C0H , user
         *  could configure C0H into this register
         */
        uint32_t mem_nand_flash_sr_addr3:8;
    };
    uint32_t val;
} spi_mem_c_nand_flash_sr_addr0_reg_t;

/** Type of mem_nand_flash_sr_din0 register
 *  NAND FLASH SPI SEQ control register
 */
typedef union {
    struct {
        /** mem_nand_flash_sr_din0 : RO; bitpos: [7:0]; default: 0;
         *  spi read state register data to this register for SPI SEQ need.
         *  spi_mem_c_NAND_FLASH_SR_DIN0_REG corresponds to spi_mem_c_NAND_FLASH_SR_ADDR0_REG.
         */
        uint32_t mem_nand_flash_sr_din0:8;
        /** mem_nand_flash_sr_din1 : RO; bitpos: [15:8]; default: 0;
         *  spi read state register data to this register for SPI SEQ need.
         *  spi_mem_c_NAND_FLASH_SR_DIN0_REG corresponds to spi_mem_c_NAND_FLASH_SR_ADDR0_REG.
         */
        uint32_t mem_nand_flash_sr_din1:8;
        /** mem_nand_flash_sr_din2 : RO; bitpos: [23:16]; default: 0;
         *  spi read state register data to this register for SPI SEQ need.
         *  spi_mem_c_NAND_FLASH_SR_DIN0_REG corresponds to spi_mem_c_NAND_FLASH_SR_ADDR0_REG.
         */
        uint32_t mem_nand_flash_sr_din2:8;
        /** mem_nand_flash_sr_din3 : RO; bitpos: [31:24]; default: 0;
         *  spi read state register data to this register for SPI SEQ need.
         *  spi_mem_c_NAND_FLASH_SR_DIN0_REG corresponds to spi_mem_c_NAND_FLASH_SR_ADDR0_REG.
         */
        uint32_t mem_nand_flash_sr_din3:8;
    };
    uint32_t val;
} spi_mem_c_nand_flash_sr_din0_reg_t;

/** Type of mem_nand_flash_cfg_data0 register
 *  NAND FLASH SPI SEQ control register
 */
typedef union {
    struct {
        /** mem_nand_flash_cfg_data0 : HRO; bitpos: [15:0]; default: 0;
         *  configure data for SPI SEQ din/dout need. The data could be use to configure NAND
         *  FLASH or compare read data
         */
        uint32_t mem_nand_flash_cfg_data0:16;
        /** mem_nand_flash_cfg_data1 : HRO; bitpos: [31:16]; default: 0;
         *  configure data for SPI SEQ din/dout need. The data could be use to configure NAND
         *  FLASH or compare read data
         */
        uint32_t mem_nand_flash_cfg_data1:16;
    };
    uint32_t val;
} spi_mem_c_nand_flash_cfg_data0_reg_t;

/** Type of mem_nand_flash_cfg_data1 register
 *  NAND FLASH SPI SEQ control register
 */
typedef union {
    struct {
        /** mem_nand_flash_cfg_data2 : HRO; bitpos: [15:0]; default: 0;
         *  configure data for SPI SEQ din/dout need. The data could be use to configure NAND
         *  FLASH or compare read data
         */
        uint32_t mem_nand_flash_cfg_data2:16;
        /** mem_nand_flash_cfg_data3 : HRO; bitpos: [31:16]; default: 0;
         *  configure data for SPI SEQ din/dout need. The data could be use to configure NAND
         *  FLASH or compare read data
         */
        uint32_t mem_nand_flash_cfg_data3:16;
    };
    uint32_t val;
} spi_mem_c_nand_flash_cfg_data1_reg_t;

/** Type of mem_nand_flash_cfg_data2 register
 *  NAND FLASH SPI SEQ control register
 */
typedef union {
    struct {
        /** mem_nand_flash_cfg_data4 : HRO; bitpos: [15:0]; default: 0;
         *  configure data for SPI SEQ din/dout need. The data could be use to configure NAND
         *  FLASH or compare read data
         */
        uint32_t mem_nand_flash_cfg_data4:16;
        /** mem_nand_flash_cfg_data5 : HRO; bitpos: [31:16]; default: 0;
         *  configure data for SPI SEQ din/dout need. The data could be use to configure NAND
         *  FLASH or compare read data
         */
        uint32_t mem_nand_flash_cfg_data5:16;
    };
    uint32_t val;
} spi_mem_c_nand_flash_cfg_data2_reg_t;

/** Type of mem_nand_flash_cmd_lut0 register
 *  MSPI NAND FLASH CMD LUT control register
 */
typedef union {
    struct {
        /** mem_nand_flash_lut_cmd_value0 : HRO; bitpos: [15:0]; default: 0;
         *  MSPI NAND FLASH config cmd value at cmd lut address 0.
         */
        uint32_t mem_nand_flash_lut_cmd_value0:16;
        /** mem_nand_flash_lut_sfsm_st_en0 : HRO; bitpos: [19:16]; default: 0;
         *  MSPI NAND FLASH config sfsm_st_en at cmd lut address 0.[3]-ADDR period enable;
         *  [2]-DUMMY period enable; [1]-DIN period; [0]-DOUT period.
         */
        uint32_t mem_nand_flash_lut_sfsm_st_en0:4;
        /** mem_nand_flash_lut_cmd_len0 : HRO; bitpos: [23:20]; default: 0;
         *  MSPI NAND FLASH config cmd length at cmd lut address 0.
         */
        uint32_t mem_nand_flash_lut_cmd_len0:4;
        /** mem_nand_flash_lut_addr_len0 : HRO; bitpos: [27:24]; default: 0;
         *  MSPI NAND FLASH config address length at cmd lut address 0.
         */
        uint32_t mem_nand_flash_lut_addr_len0:4;
        /** mem_nand_flash_lut_data_len0 : HRO; bitpos: [29:28]; default: 0;
         *  MSPI NAND FLASH config data length at cmd lut address 0.
         */
        uint32_t mem_nand_flash_lut_data_len0:2;
        /** mem_nand_flash_lut_bus_en0 : HRO; bitpos: [30]; default: 0;
         *  MSPI NAND FLASH config spi_bus_en at cmd lut address 0,SPI could use DUAL/QUAD mode
         *  while enable, SPI could use SINGLE mode while disable.1:Enable. 0:Disable.(Note
         *  these registers are described to indicate the spi_mem_c_NAND_FLASH_CMD_LUT0_REG's
         *  field. The number of CMD LUT entries can be defined by the user, but cannot exceed
         *  16 )
         */
        uint32_t mem_nand_flash_lut_bus_en0:1;
        uint32_t reserved_31:1;
    };
    uint32_t val;
} spi_mem_c_nand_flash_cmd_lut0_reg_t;

