espressif/esp-idf/components/soc/esp32h21/register/soc/spi_mem_c_struct.h
/** Type of mem_nand_flash_cmd_lut9 register
 *  MSPI NAND FLASH CMD LUT control register
 */
typedef union {
    struct {
        /** mem_nand_flash_lut_cmd_value9 : HRO; bitpos: [15:0]; default: 0;
         *  MSPI NAND FLASH config cmd value at cmd lut address 9.
         */
        uint32_t mem_nand_flash_lut_cmd_value9:16;
        /** mem_nand_flash_lut_sfsm_st_en9 : HRO; bitpos: [19:16]; default: 0;
         *  MSPI NAND FLASH config sfsm_st_en at cmd lut address 9.[3]-ADDR period enable;
         *  [2]-DUMMY period enable; [1]-DIN period; [0]-DOUT period.
         */
        uint32_t mem_nand_flash_lut_sfsm_st_en9:4;
        /** mem_nand_flash_lut_cmd_len9 : HRO; bitpos: [23:20]; default: 0;
         *  MSPI NAND FLASH config cmd length at cmd lut address 9.
         */
        uint32_t mem_nand_flash_lut_cmd_len9:4;
        /** mem_nand_flash_lut_addr_len9 : HRO; bitpos: [27:24]; default: 0;
         *  MSPI NAND FLASH config address length at cmd lut address 9.
         */
        uint32_t mem_nand_flash_lut_addr_len9:4;
        /** mem_nand_flash_lut_data_len9 : HRO; bitpos: [29:28]; default: 0;
         *  MSPI NAND FLASH config data length at cmd lut address 9.
         */
        uint32_t mem_nand_flash_lut_data_len9:2;
        /** mem_nand_flash_lut_bus_en9 : HRO; bitpos: [30]; default: 0;
         *  MSPI NAND FLASH config spi_bus_en at cmd lut address 9,SPI could use DUAL/QUAD mode
         *  while enable, SPI could use SINGLE mode while disable.1:Enable. 0:Disable.(Note
         *  these registers are described to indicate the spi_mem_c_NAND_FLASH_CMD_LUT9_REG's
         *  field. The number of CMD LUT entries can be defined by the user, but cannot exceed
         *  16 )
         */
        uint32_t mem_nand_flash_lut_bus_en9:1;
        uint32_t reserved_31:1;
    };
    uint32_t val;
} spi_mem_c_nand_flash_cmd_lut9_reg_t;

/** Type of mem_nand_flash_cmd_lut10 register
 *  MSPI NAND FLASH CMD LUT control register
 */
typedef union {
    struct {
        /** mem_nand_flash_lut_cmd_value10 : HRO; bitpos: [15:0]; default: 0;
         *  MSPI NAND FLASH config cmd value at cmd lut address 10.
         */
        uint32_t mem_nand_flash_lut_cmd_value10:16;
        /** mem_nand_flash_lut_sfsm_st_en10 : HRO; bitpos: [19:16]; default: 0;
         *  MSPI NAND FLASH config sfsm_st_en at cmd lut address 10.[3]-ADDR period enable;
         *  [2]-DUMMY period enable; [1]-DIN period; [0]-DOUT period.
         */
        uint32_t mem_nand_flash_lut_sfsm_st_en10:4;
        /** mem_nand_flash_lut_cmd_len10 : HRO; bitpos: [23:20]; default: 0;
         *  MSPI NAND FLASH config cmd length at cmd lut address 10.
         */
        uint32_t mem_nand_flash_lut_cmd_len10:4;
        /** mem_nand_flash_lut_addr_len10 : HRO; bitpos: [27:24]; default: 0;
         *  MSPI NAND FLASH config address length at cmd lut address 10.
         */
        uint32_t mem_nand_flash_lut_addr_len10:4;
        /** mem_nand_flash_lut_data_len10 : HRO; bitpos: [29:28]; default: 0;
         *  MSPI NAND FLASH config data length at cmd lut address 10.
         */
        uint32_t mem_nand_flash_lut_data_len10:2;
        /** mem_nand_flash_lut_bus_en10 : HRO; bitpos: [30]; default: 0;
         *  MSPI NAND FLASH config spi_bus_en at cmd lut address 10,SPI could use DUAL/QUAD
         *  mode while enable, SPI could use SINGLE mode while disable.1:Enable.
         *  0:Disable.(Note these registers are described to indicate the
         *  spi_mem_c_NAND_FLASH_CMD_LUT10_REG's field. The number of CMD LUT entries can be
         *  defined by the user, but cannot exceed 16 )
         */
        uint32_t mem_nand_flash_lut_bus_en10:1;
        uint32_t reserved_31:1;
    };
    uint32_t val;
} spi_mem_c_nand_flash_cmd_lut10_reg_t;

/** Type of mem_nand_flash_cmd_lut11 register
 *  MSPI NAND FLASH CMD LUT control register
 */
typedef union {
    struct {
        /** mem_nand_flash_lut_cmd_value11 : HRO; bitpos: [15:0]; default: 0;
         *  MSPI NAND FLASH config cmd value at cmd lut address 11.
         */
        uint32_t mem_nand_flash_lut_cmd_value11:16;
        /** mem_nand_flash_lut_sfsm_st_en11 : HRO; bitpos: [19:16]; default: 0;
         *  MSPI NAND FLASH config sfsm_st_en at cmd lut address 11.[3]-ADDR period enable;
         *  [2]-DUMMY period enable; [1]-DIN period; [0]-DOUT period.
         */
        uint32_t mem_nand_flash_lut_sfsm_st_en11:4;
        /** mem_nand_flash_lut_cmd_len11 : HRO; bitpos: [23:20]; default: 0;
         *  MSPI NAND FLASH config cmd length at cmd lut address 11.
         */
        uint32_t mem_nand_flash_lut_cmd_len11:4;
        /** mem_nand_flash_lut_addr_len11 : HRO; bitpos: [27:24]; default: 0;
         *  MSPI NAND FLASH config address length at cmd lut address 11.
         */
        uint32_t mem_nand_flash_lut_addr_len11:4;
        /** mem_nand_flash_lut_data_len11 : HRO; bitpos: [29:28]; default: 0;
         *  MSPI NAND FLASH config data length at cmd lut address 11.
         */
        uint32_t mem_nand_flash_lut_data_len11:2;
        /** mem_nand_flash_lut_bus_en11 : HRO; bitpos: [30]; default: 0;
         *  MSPI NAND FLASH config spi_bus_en at cmd lut address 11,SPI could use DUAL/QUAD
         *  mode while enable, SPI could use SINGLE mode while disable.1:Enable.
         *  0:Disable.(Note these registers are described to indicate the
         *  spi_mem_c_NAND_FLASH_CMD_LUT11_REG's field. The number of CMD LUT entries can be
         *  defined by the user, but cannot exceed 16 )
         */
        uint32_t mem_nand_flash_lut_bus_en11:1;
        uint32_t reserved_31:1;
    };
    uint32_t val;
} spi_mem_c_nand_flash_cmd_lut11_reg_t;

/** Type of mem_nand_flash_cmd_lut12 register
 *  MSPI NAND FLASH CMD LUT control register
 */
typedef union {
    struct {
        /** mem_nand_flash_lut_cmd_value12 : HRO; bitpos: [15:0]; default: 0;
         *  MSPI NAND FLASH config cmd value at cmd lut address 12.
         */
        uint32_t mem_nand_flash_lut_cmd_value12:16;
        /** mem_nand_flash_lut_sfsm_st_en12 : HRO; bitpos: [19:16]; default: 0;
         *  MSPI NAND FLASH config sfsm_st_en at cmd lut address 12.[3]-ADDR period enable;
         *  [2]-DUMMY period enable; [1]-DIN period; [0]-DOUT period.
         */
        uint32_t mem_nand_flash_lut_sfsm_st_en12:4;
        /** mem_nand_flash_lut_cmd_len12 : HRO; bitpos: [23:20]; default: 0;
         *  MSPI NAND FLASH config cmd length at cmd lut address 12.
         */
        uint32_t mem_nand_flash_lut_cmd_len12:4;
        /** mem_nand_flash_lut_addr_len12 : HRO; bitpos: [27:24]; default: 0;
         *  MSPI NAND FLASH config address length at cmd lut address 12.
         */
        uint32_t mem_nand_flash_lut_addr_len12:4;
        /** mem_nand_flash_lut_data_len12 : HRO; bitpos: [29:28]; default: 0;
         *  MSPI NAND FLASH config data length at cmd lut address 12.
         */
        uint32_t mem_nand_flash_lut_data_len12:2;
        /** mem_nand_flash_lut_bus_en12 : HRO; bitpos: [30]; default: 0;
         *  MSPI NAND FLASH config spi_bus_en at cmd lut address 12,SPI could use DUAL/QUAD
         *  mode while enable, SPI could use SINGLE mode while disable.1:Enable.
         *  0:Disable.(Note these registers are described to indicate the
         *  spi_mem_c_NAND_FLASH_CMD_LUT12_REG's field. The number of CMD LUT entries can be
         *  defined by the user, but cannot exceed 16 )
         */
        uint32_t mem_nand_flash_lut_bus_en12:1;
        uint32_t reserved_31:1;
    };
    uint32_t val;
} spi_mem_c_nand_flash_cmd_lut12_reg_t;

/** Type of mem_nand_flash_cmd_lut13 register
 *  MSPI NAND FLASH CMD LUT control register
 */
typedef union {
    struct {
        /** mem_nand_flash_lut_cmd_value13 : HRO; bitpos: [15:0]; default: 0;
         *  MSPI NAND FLASH config cmd value at cmd lut address 13.
         */
        uint32_t mem_nand_flash_lut_cmd_value13:16;
        /** mem_nand_flash_lut_sfsm_st_en13 : HRO; bitpos: [19:16]; default: 0;
         *  MSPI NAND FLASH config sfsm_st_en at cmd lut address 13.[3]-ADDR period enable;
         *  [2]-DUMMY period enable; [1]-DIN period; [0]-DOUT period.
         */
        uint32_t mem_nand_flash_lut_sfsm_st_en13:4;
        /** mem_nand_flash_lut_cmd_len13 : HRO; bitpos: [23:20]; default: 0;
         *  MSPI NAND FLASH config cmd length at cmd lut address 13.
         */
        uint32_t mem_nand_flash_lut_cmd_len13:4;
        /** mem_nand_flash_lut_addr_len13 : HRO; bitpos: [27:24]; default: 0;
         *  MSPI NAND FLASH config address length at cmd lut address 13.
         */
        uint32_t mem_nand_flash_lut_addr_len13:4;
        /** mem_nand_flash_lut_data_len13 : HRO; bitpos: [29:28]; default: 0;
         *  MSPI NAND FLASH config data length at cmd lut address 13.
         */
        uint32_t mem_nand_flash_lut_data_len13:2;
        /** mem_nand_flash_lut_bus_en13 : HRO; bitpos: [30]; default: 0;
         *  MSPI NAND FLASH config spi_bus_en at cmd lut address 13,SPI could use DUAL/QUAD
         *  mode while enable, SPI could use SINGLE mode while disable.1:Enable.
         *  0:Disable.(Note these registers are described to indicate the
         *  spi_mem_c_NAND_FLASH_CMD_LUT13_REG's field. The number of CMD LUT entries can be
         *  defined by the user, but cannot exceed 16 )
         */
        uint32_t mem_nand_flash_lut_bus_en13:1;
        uint32_t reserved_31:1;
    };
    uint32_t val;
} spi_mem_c_nand_flash_cmd_lut13_reg_t;

/** Type of mem_nand_flash_cmd_lut14 register
 *  MSPI NAND FLASH CMD LUT control register
 */
typedef union {
    struct {
        /** mem_nand_flash_lut_cmd_value14 : HRO; bitpos: [15:0]; default: 0;
         *  MSPI NAND FLASH config cmd value at cmd lut address 14.
         */
        uint32_t mem_nand_flash_lut_cmd_value14:16;
        /** mem_nand_flash_lut_sfsm_st_en14 : HRO; bitpos: [19:16]; default: 0;
         *  MSPI NAND FLASH config sfsm_st_en at cmd lut address 14.[3]-ADDR period enable;
         *  [2]-DUMMY period enable; [1]-DIN period; [0]-DOUT period.
         */
        uint32_t mem_nand_flash_lut_sfsm_st_en14:4;
        /** mem_nand_flash_lut_cmd_len14 : HRO; bitpos: [23:20]; default: 0;
         *  MSPI NAND FLASH config cmd length at cmd lut address 14.
         */
        uint32_t mem_nand_flash_lut_cmd_len14:4;
        /** mem_nand_flash_lut_addr_len14 : HRO; bitpos: [27:24]; default: 0;
         *  MSPI NAND FLASH config address length at cmd lut address 14.
         */
        uint32_t mem_nand_flash_lut_addr_len14:4;
        /** mem_nand_flash_lut_data_len14 : HRO; bitpos: [29:28]; default: 0;
         *  MSPI NAND FLASH config data length at cmd lut address 14.
         */
        uint32_t mem_nand_flash_lut_data_len14:2;
        /** mem_nand_flash_lut_bus_en14 : HRO; bitpos: [30]; default: 0;
         *  MSPI NAND FLASH config spi_bus_en at cmd lut address 14,SPI could use DUAL/QUAD
         *  mode while enable, SPI could use SINGLE mode while disable.1:Enable.
         *  0:Disable.(Note these registers are described to indicate the
         *  spi_mem_c_NAND_FLASH_CMD_LUT14_REG's field. The number of CMD LUT entries can be
         *  defined by the user, but cannot exceed 16 )
         */
        uint32_t mem_nand_flash_lut_bus_en14:1;
        uint32_t reserved_31:1;
    };
    uint32_t val;
} spi_mem_c_nand_flash_cmd_lut14_reg_t;

/** Type of mem_nand_flash_cmd_lut15 register
 *  MSPI NAND FLASH CMD LUT control register
 */
typedef union {
    struct {
        /** mem_nand_flash_lut_cmd_value15 : HRO; bitpos: [15:0]; default: 0;
         *  MSPI NAND FLASH config cmd value at cmd lut address 15.
         */
        uint32_t mem_nand_flash_lut_cmd_value15:16;
        /** mem_nand_flash_lut_sfsm_st_en15 : HRO; bitpos: [19:16]; default: 0;
         *  MSPI NAND FLASH config sfsm_st_en at cmd lut address 15.[3]-ADDR period enable;
         *  [2]-DUMMY period enable; [1]-DIN period; [0]-DOUT period.
         */
        uint32_t mem_nand_flash_lut_sfsm_st_en15:4;
        /** mem_nand_flash_lut_cmd_len15 : HRO; bitpos: [23:20]; default: 0;
         *  MSPI NAND FLASH config cmd length at cmd lut address 15.
         */
        uint32_t mem_nand_flash_lut_cmd_len15:4;
        /** mem_nand_flash_lut_addr_len15 : HRO; bitpos: [27:24]; default: 0;
         *  MSPI NAND FLASH config address length at cmd lut address 15.
         */
        uint32_t mem_nand_flash_lut_addr_len15:4;
        /** mem_nand_flash_lut_data_len15 : HRO; bitpos: [29:28]; default: 0;
         *  MSPI NAND FLASH config data length at cmd lut address 15.
         */
        uint32_t mem_nand_flash_lut_data_len15:2;
        /** mem_nand_flash_lut_bus_en15 : HRO; bitpos: [30]; default: 0;
         *  MSPI NAND FLASH config spi_bus_en at cmd lut address 15,SPI could use DUAL/QUAD
         *  mode while enable, SPI could use SINGLE mode while disable.1:Enable.
         *  0:Disable.(Note these registers are described to indicate the
         *  spi_mem_c_NAND_FLASH_CMD_LUT15_REG's field. The number of CMD LUT entries can be
         *  defined by the user, but cannot exceed 16 )
         */
        uint32_t mem_nand_flash_lut_bus_en15:1;
        uint32_t reserved_31:1;
    };
    uint32_t val;
} spi_mem_c_nand_flash_cmd_lut15_reg_t;

/** Type of mem_nand_flash_spi_seq0 register
 *  NAND FLASH SPI SEQ control register
 */
typedef union {
    struct {
        /** mem_nand_flash_seq_tail_flg0 : HRO; bitpos: [0]; default: 0;
         *  MSPI NAND FLASH config seq_tail_flg at spi seq index 0.1: The last index for
         *  sequence. 0: Not the last index.
         */
        uint32_t mem_nand_flash_seq_tail_flg0:1;
        /** mem_nand_flash_sr_chk_en0 : HRO; bitpos: [1]; default: 0;
         *  MSPI NAND FLASH config sr_chk_en at spi seq index 0. 1: enable 0: disable.
         */
        uint32_t mem_nand_flash_sr_chk_en0:1;
        /** mem_nand_flash_din_index0 : HRO; bitpos: [5:2]; default: 0;
         *  MSPI NAND FLASH config din_index at spi seq index 0.  Use with
         *  spi_mem_c_NAND_FLASH_CFG_DATA
         */
        uint32_t mem_nand_flash_din_index0:4;
        /** mem_nand_flash_addr_index0 : HRO; bitpos: [9:6]; default: 0;
         *  MSPI NAND FLASH config addr_index at spi seq index 0.  Use with
         *  spi_mem_c_NAND_FLASH_SR_ADDR
         */
        uint32_t mem_nand_flash_addr_index0:4;
        /** mem_nand_flash_req_or_cfg0 : HRO; bitpos: [10]; default: 0;
         *  MSPI NAND FLASH config reg_or_cfg at spi seq index 0. 1: AXI/APB request  0: SPI
         *  SEQ configuration.
         */
        uint32_t mem_nand_flash_req_or_cfg0:1;
        /** mem_nand_flash_cmd_index0 : HRO; bitpos: [14:11]; default: 0;
         *  MSPI NAND FLASH config spi_cmd_index at spi seq index 0. Use to find SPI command in
         *  CMD LUT.(Note these registers are described to indicate the
         *  spi_mem_c_NAND_FLASH_SPI_SEQ_REG' fieldd The number of CMD LUT entries can be defined
         *  by the user, but cannot exceed 16 )
         */
        uint32_t mem_nand_flash_cmd_index0:4;
        uint32_t reserved_15:17;
    };
    uint32_t val;
} spi_mem_c_nand_flash_spi_seq0_reg_t;

/** Type of mem_nand_flash_spi_seq1 register
 *  NAND FLASH SPI SEQ control register
 */
typedef union {
    struct {
        /** mem_nand_flash_seq_tail_flg1 : HRO; bitpos: [0]; default: 0;
         *  MSPI NAND FLASH config seq_tail_flg at spi seq index 1.1: The last index for
         *  sequence. 0: Not the last index.
         */
        uint32_t mem_nand_flash_seq_tail_flg1:1;
        /** mem_nand_flash_sr_chk_en1 : HRO; bitpos: [1]; default: 0;
         *  MSPI NAND FLASH config sr_chk_en at spi seq index 1. 1: enable 0: disable.
         */
        uint32_t mem_nand_flash_sr_chk_en1:1;
        /** mem_nand_flash_din_index1 : HRO; bitpos: [5:2]; default: 0;
         *  MSPI NAND FLASH config din_index at spi seq index 1.  Use with
         *  spi_mem_c_NAND_FLASH_CFG_DATA
         */
        uint32_t mem_nand_flash_din_index1:4;
        /** mem_nand_flash_addr_index1 : HRO; bitpos: [9:6]; default: 0;
         *  MSPI NAND FLASH config addr_index at spi seq index 1.  Use with
         *  spi_mem_c_NAND_FLASH_SR_ADDR
         */
        uint32_t mem_nand_flash_addr_index1:4;
        /** mem_nand_flash_req_or_cfg1 : HRO; bitpos: [10]; default: 0;
         *  MSPI NAND FLASH config reg_or_cfg at spi seq index 1. 1: AXI/APB request  0: SPI
         *  SEQ configuration.
         */
        uint32_t mem_nand_flash_req_or_cfg1:1;
        /** mem_nand_flash_cmd_index1 : HRO; bitpos: [14:11]; default: 0;
         *  MSPI NAND FLASH config spi_cmd_index at spi seq index 1. Use to find SPI command in
         *  CMD LUT.(Note these registers are described to indicate the
         *  spi_mem_c_NAND_FLASH_SPI_SEQ_REG' fieldd The number of CMD LUT entries can be defined
         *  by the user, but cannot exceed 16 )
         */
        uint32_t mem_nand_flash_cmd_index1:4;
        uint32_t reserved_15:17;
    };
    uint32_t val;
} spi_mem_c_nand_flash_spi_seq1_reg_t;

