espressif/esp-idf/components/soc/esp32h21/register/soc/spi_mem_c_struct.h
/** Type of mem_nand_flash_spi_seq7 register
 *  NAND FLASH SPI SEQ control register
 */
typedef union {
    struct {
        /** mem_nand_flash_seq_tail_flg7 : HRO; bitpos: [0]; default: 0;
         *  MSPI NAND FLASH config seq_tail_flg at spi seq index 7.1: The last index for
         *  sequence. 0: Not the last index.
         */
        uint32_t mem_nand_flash_seq_tail_flg7:1;
        /** mem_nand_flash_sr_chk_en7 : HRO; bitpos: [1]; default: 0;
         *  MSPI NAND FLASH config sr_chk_en at spi seq index 7. 1: enable 0: disable.
         */
        uint32_t mem_nand_flash_sr_chk_en7:1;
        /** mem_nand_flash_din_index7 : HRO; bitpos: [5:2]; default: 0;
         *  MSPI NAND FLASH config din_index at spi seq index 7.  Use with
         *  spi_mem_c_NAND_FLASH_CFG_DATA
         */
        uint32_t mem_nand_flash_din_index7:4;
        /** mem_nand_flash_addr_index7 : HRO; bitpos: [9:6]; default: 0;
         *  MSPI NAND FLASH config addr_index at spi seq index 7.  Use with
         *  spi_mem_c_NAND_FLASH_SR_ADDR
         */
        uint32_t mem_nand_flash_addr_index7:4;
        /** mem_nand_flash_req_or_cfg7 : HRO; bitpos: [10]; default: 0;
         *  MSPI NAND FLASH config reg_or_cfg at spi seq index 7. 1: AXI/APB request  0: SPI
         *  SEQ configuration.
         */
        uint32_t mem_nand_flash_req_or_cfg7:1;
        /** mem_nand_flash_cmd_index7 : HRO; bitpos: [14:11]; default: 0;
         *  MSPI NAND FLASH config spi_cmd_index at spi seq index 7. Use to find SPI command in
         *  CMD LUT.(Note these registers are described to indicate the
         *  spi_mem_c_NAND_FLASH_SPI_SEQ_REG' fieldd The number of CMD LUT entries can be defined
         *  by the user, but cannot exceed 16 )
         */
        uint32_t mem_nand_flash_cmd_index7:4;
        uint32_t reserved_15:17;
    };
    uint32_t val;
} spi_mem_c_nand_flash_spi_seq7_reg_t;

/** Type of mem_nand_flash_spi_seq8 register
 *  NAND FLASH SPI SEQ control register
 */
typedef union {
    struct {
        /** mem_nand_flash_seq_tail_flg8 : HRO; bitpos: [0]; default: 0;
         *  MSPI NAND FLASH config seq_tail_flg at spi seq index 8.1: The last index for
         *  sequence. 0: Not the last index.
         */
        uint32_t mem_nand_flash_seq_tail_flg8:1;
        /** mem_nand_flash_sr_chk_en8 : HRO; bitpos: [1]; default: 0;
         *  MSPI NAND FLASH config sr_chk_en at spi seq index 8. 1: enable 0: disable.
         */
        uint32_t mem_nand_flash_sr_chk_en8:1;
        /** mem_nand_flash_din_index8 : HRO; bitpos: [5:2]; default: 0;
         *  MSPI NAND FLASH config din_index at spi seq index 8.  Use with
         *  spi_mem_c_NAND_FLASH_CFG_DATA
         */
        uint32_t mem_nand_flash_din_index8:4;
        /** mem_nand_flash_addr_index8 : HRO; bitpos: [9:6]; default: 0;
         *  MSPI NAND FLASH config addr_index at spi seq index 8.  Use with
         *  spi_mem_c_NAND_FLASH_SR_ADDR
         */
        uint32_t mem_nand_flash_addr_index8:4;
        /** mem_nand_flash_req_or_cfg8 : HRO; bitpos: [10]; default: 0;
         *  MSPI NAND FLASH config reg_or_cfg at spi seq index 8. 1: AXI/APB request  0: SPI
         *  SEQ configuration.
         */
        uint32_t mem_nand_flash_req_or_cfg8:1;
        /** mem_nand_flash_cmd_index8 : HRO; bitpos: [14:11]; default: 0;
         *  MSPI NAND FLASH config spi_cmd_index at spi seq index 8. Use to find SPI command in
         *  CMD LUT.(Note these registers are described to indicate the
         *  spi_mem_c_NAND_FLASH_SPI_SEQ_REG' fieldd The number of CMD LUT entries can be defined
         *  by the user, but cannot exceed 16 )
         */
        uint32_t mem_nand_flash_cmd_index8:4;
        uint32_t reserved_15:17;
    };
    uint32_t val;
} spi_mem_c_nand_flash_spi_seq8_reg_t;

/** Type of mem_nand_flash_spi_seq9 register
 *  NAND FLASH SPI SEQ control register
 */
typedef union {
    struct {
        /** mem_nand_flash_seq_tail_flg9 : HRO; bitpos: [0]; default: 0;
         *  MSPI NAND FLASH config seq_tail_flg at spi seq index 9.1: The last index for
         *  sequence. 0: Not the last index.
         */
        uint32_t mem_nand_flash_seq_tail_flg9:1;
        /** mem_nand_flash_sr_chk_en9 : HRO; bitpos: [1]; default: 0;
         *  MSPI NAND FLASH config sr_chk_en at spi seq index 9. 1: enable 0: disable.
         */
        uint32_t mem_nand_flash_sr_chk_en9:1;
        /** mem_nand_flash_din_index9 : HRO; bitpos: [5:2]; default: 0;
         *  MSPI NAND FLASH config din_index at spi seq index 9.  Use with
         *  spi_mem_c_NAND_FLASH_CFG_DATA
         */
        uint32_t mem_nand_flash_din_index9:4;
        /** mem_nand_flash_addr_index9 : HRO; bitpos: [9:6]; default: 0;
         *  MSPI NAND FLASH config addr_index at spi seq index 9.  Use with
         *  spi_mem_c_NAND_FLASH_SR_ADDR
         */
        uint32_t mem_nand_flash_addr_index9:4;
        /** mem_nand_flash_req_or_cfg9 : HRO; bitpos: [10]; default: 0;
         *  MSPI NAND FLASH config reg_or_cfg at spi seq index 9. 1: AXI/APB request  0: SPI
         *  SEQ configuration.
         */
        uint32_t mem_nand_flash_req_or_cfg9:1;
        /** mem_nand_flash_cmd_index9 : HRO; bitpos: [14:11]; default: 0;
         *  MSPI NAND FLASH config spi_cmd_index at spi seq index 9. Use to find SPI command in
         *  CMD LUT.(Note these registers are described to indicate the
         *  spi_mem_c_NAND_FLASH_SPI_SEQ_REG' fieldd The number of CMD LUT entries can be defined
         *  by the user, but cannot exceed 16 )
         */
        uint32_t mem_nand_flash_cmd_index9:4;
        uint32_t reserved_15:17;
    };
    uint32_t val;
} spi_mem_c_nand_flash_spi_seq9_reg_t;

/** Type of mem_nand_flash_spi_seq10 register
 *  NAND FLASH SPI SEQ control register
 */
typedef union {
    struct {
        /** mem_nand_flash_seq_tail_flg10 : HRO; bitpos: [0]; default: 0;
         *  MSPI NAND FLASH config seq_tail_flg at spi seq index 10.1: The last index for
         *  sequence. 0: Not the last index.
         */
        uint32_t mem_nand_flash_seq_tail_flg10:1;
        /** mem_nand_flash_sr_chk_en10 : HRO; bitpos: [1]; default: 0;
         *  MSPI NAND FLASH config sr_chk_en at spi seq index 10. 1: enable 0: disable.
         */
        uint32_t mem_nand_flash_sr_chk_en10:1;
        /** mem_nand_flash_din_index10 : HRO; bitpos: [5:2]; default: 0;
         *  MSPI NAND FLASH config din_index at spi seq index 10.  Use with
         *  spi_mem_c_NAND_FLASH_CFG_DATA
         */
        uint32_t mem_nand_flash_din_index10:4;
        /** mem_nand_flash_addr_index10 : HRO; bitpos: [9:6]; default: 0;
         *  MSPI NAND FLASH config addr_index at spi seq index 10.  Use with
         *  spi_mem_c_NAND_FLASH_SR_ADDR
         */
        uint32_t mem_nand_flash_addr_index10:4;
        /** mem_nand_flash_req_or_cfg10 : HRO; bitpos: [10]; default: 0;
         *  MSPI NAND FLASH config reg_or_cfg at spi seq index 10. 1: AXI/APB request  0: SPI
         *  SEQ configuration.
         */
        uint32_t mem_nand_flash_req_or_cfg10:1;
        /** mem_nand_flash_cmd_index10 : HRO; bitpos: [14:11]; default: 0;
         *  MSPI NAND FLASH config spi_cmd_index at spi seq index 10. Use to find SPI command
         *  in CMD LUT.(Note these registers are described to indicate the
         *  spi_mem_c_NAND_FLASH_SPI_SEQ_REG' fieldd The number of CMD LUT entries can be defined
         *  by the user, but cannot exceed 16 )
         */
        uint32_t mem_nand_flash_cmd_index10:4;
        uint32_t reserved_15:17;
    };
    uint32_t val;
} spi_mem_c_nand_flash_spi_seq10_reg_t;

/** Type of mem_nand_flash_spi_seq11 register
 *  NAND FLASH SPI SEQ control register
 */
typedef union {
    struct {
        /** mem_nand_flash_seq_tail_flg11 : HRO; bitpos: [0]; default: 0;
         *  MSPI NAND FLASH config seq_tail_flg at spi seq index 11.1: The last index for
         *  sequence. 0: Not the last index.
         */
        uint32_t mem_nand_flash_seq_tail_flg11:1;
        /** mem_nand_flash_sr_chk_en11 : HRO; bitpos: [1]; default: 0;
         *  MSPI NAND FLASH config sr_chk_en at spi seq index 11. 1: enable 0: disable.
         */
        uint32_t mem_nand_flash_sr_chk_en11:1;
        /** mem_nand_flash_din_index11 : HRO; bitpos: [5:2]; default: 0;
         *  MSPI NAND FLASH config din_index at spi seq index 11.  Use with
         *  spi_mem_c_NAND_FLASH_CFG_DATA
         */
        uint32_t mem_nand_flash_din_index11:4;
        /** mem_nand_flash_addr_index11 : HRO; bitpos: [9:6]; default: 0;
         *  MSPI NAND FLASH config addr_index at spi seq index 11.  Use with
         *  spi_mem_c_NAND_FLASH_SR_ADDR
         */
        uint32_t mem_nand_flash_addr_index11:4;
        /** mem_nand_flash_req_or_cfg11 : HRO; bitpos: [10]; default: 0;
         *  MSPI NAND FLASH config reg_or_cfg at spi seq index 11. 1: AXI/APB request  0: SPI
         *  SEQ configuration.
         */
        uint32_t mem_nand_flash_req_or_cfg11:1;
        /** mem_nand_flash_cmd_index11 : HRO; bitpos: [14:11]; default: 0;
         *  MSPI NAND FLASH config spi_cmd_index at spi seq index 11. Use to find SPI command
         *  in CMD LUT.(Note these registers are described to indicate the
         *  spi_mem_c_NAND_FLASH_SPI_SEQ_REG' fieldd The number of CMD LUT entries can be defined
         *  by the user, but cannot exceed 16 )
         */
        uint32_t mem_nand_flash_cmd_index11:4;
        uint32_t reserved_15:17;
    };
    uint32_t val;
} spi_mem_c_nand_flash_spi_seq11_reg_t;

/** Type of mem_nand_flash_spi_seq12 register
 *  NAND FLASH SPI SEQ control register
 */
typedef union {
    struct {
        /** mem_nand_flash_seq_tail_flg12 : HRO; bitpos: [0]; default: 0;
         *  MSPI NAND FLASH config seq_tail_flg at spi seq index 12.1: The last index for
         *  sequence. 0: Not the last index.
         */
        uint32_t mem_nand_flash_seq_tail_flg12:1;
        /** mem_nand_flash_sr_chk_en12 : HRO; bitpos: [1]; default: 0;
         *  MSPI NAND FLASH config sr_chk_en at spi seq index 12. 1: enable 0: disable.
         */
        uint32_t mem_nand_flash_sr_chk_en12:1;
        /** mem_nand_flash_din_index12 : HRO; bitpos: [5:2]; default: 0;
         *  MSPI NAND FLASH config din_index at spi seq index 12.  Use with
         *  spi_mem_c_NAND_FLASH_CFG_DATA
         */
        uint32_t mem_nand_flash_din_index12:4;
        /** mem_nand_flash_addr_index12 : HRO; bitpos: [9:6]; default: 0;
         *  MSPI NAND FLASH config addr_index at spi seq index 12.  Use with
         *  spi_mem_c_NAND_FLASH_SR_ADDR
         */
        uint32_t mem_nand_flash_addr_index12:4;
        /** mem_nand_flash_req_or_cfg12 : HRO; bitpos: [10]; default: 0;
         *  MSPI NAND FLASH config reg_or_cfg at spi seq index 12. 1: AXI/APB request  0: SPI
         *  SEQ configuration.
         */
        uint32_t mem_nand_flash_req_or_cfg12:1;
        /** mem_nand_flash_cmd_index12 : HRO; bitpos: [14:11]; default: 0;
         *  MSPI NAND FLASH config spi_cmd_index at spi seq index 12. Use to find SPI command
         *  in CMD LUT.(Note these registers are described to indicate the
         *  spi_mem_c_NAND_FLASH_SPI_SEQ_REG' fieldd The number of CMD LUT entries can be defined
         *  by the user, but cannot exceed 16 )
         */
        uint32_t mem_nand_flash_cmd_index12:4;
        uint32_t reserved_15:17;
    };
    uint32_t val;
} spi_mem_c_nand_flash_spi_seq12_reg_t;

