espressif/esp-idf/components/soc/esp32h21/register/soc/spi_mem_c_struct.h
/** Type of mem_nand_flash_spi_seq21 register
 *  NAND FLASH SPI SEQ control register
 */
typedef union {
    struct {
        /** mem_nand_flash_seq_tail_flg21 : HRO; bitpos: [0]; default: 0;
         *  MSPI NAND FLASH config seq_tail_flg at spi seq index 21.1: The last index for
         *  sequence. 0: Not the last index.
         */
        uint32_t mem_nand_flash_seq_tail_flg21:1;
        /** mem_nand_flash_sr_chk_en21 : HRO; bitpos: [1]; default: 0;
         *  MSPI NAND FLASH config sr_chk_en at spi seq index 21. 1: enable 0: disable.
         */
        uint32_t mem_nand_flash_sr_chk_en21:1;
        /** mem_nand_flash_din_index21 : HRO; bitpos: [5:2]; default: 0;
         *  MSPI NAND FLASH config din_index at spi seq index 21.  Use with
         *  spi_mem_c_NAND_FLASH_CFG_DATA
         */
        uint32_t mem_nand_flash_din_index21:4;
        /** mem_nand_flash_addr_index21 : HRO; bitpos: [9:6]; default: 0;
         *  MSPI NAND FLASH config addr_index at spi seq index 21.  Use with
         *  spi_mem_c_NAND_FLASH_SR_ADDR
         */
        uint32_t mem_nand_flash_addr_index21:4;
        /** mem_nand_flash_req_or_cfg21 : HRO; bitpos: [10]; default: 0;
         *  MSPI NAND FLASH config reg_or_cfg at spi seq index 21. 1: AXI/APB request  0: SPI
         *  SEQ configuration.
         */
        uint32_t mem_nand_flash_req_or_cfg21:1;
        /** mem_nand_flash_cmd_index21 : HRO; bitpos: [14:11]; default: 0;
         *  MSPI NAND FLASH config spi_cmd_index at spi seq index 21. Use to find SPI command
         *  in CMD LUT.(Note these registers are described to indicate the
         *  spi_mem_c_NAND_FLASH_SPI_SEQ_REG' fieldd The number of CMD LUT entries can be defined
         *  by the user, but cannot exceed 16 )
         */
        uint32_t mem_nand_flash_cmd_index21:4;
        uint32_t reserved_15:17;
    };
    uint32_t val;
} spi_mem_c_nand_flash_spi_seq21_reg_t;

/** Type of mem_nand_flash_spi_seq22 register
 *  NAND FLASH SPI SEQ control register
 */
typedef union {
    struct {
        /** mem_nand_flash_seq_tail_flg22 : HRO; bitpos: [0]; default: 0;
         *  MSPI NAND FLASH config seq_tail_flg at spi seq index 22.1: The last index for
         *  sequence. 0: Not the last index.
         */
        uint32_t mem_nand_flash_seq_tail_flg22:1;
        /** mem_nand_flash_sr_chk_en22 : HRO; bitpos: [1]; default: 0;
         *  MSPI NAND FLASH config sr_chk_en at spi seq index 22. 1: enable 0: disable.
         */
        uint32_t mem_nand_flash_sr_chk_en22:1;
        /** mem_nand_flash_din_index22 : HRO; bitpos: [5:2]; default: 0;
         *  MSPI NAND FLASH config din_index at spi seq index 22.  Use with
         *  spi_mem_c_NAND_FLASH_CFG_DATA
         */
        uint32_t mem_nand_flash_din_index22:4;
        /** mem_nand_flash_addr_index22 : HRO; bitpos: [9:6]; default: 0;
         *  MSPI NAND FLASH config addr_index at spi seq index 22.  Use with
         *  spi_mem_c_NAND_FLASH_SR_ADDR
         */
        uint32_t mem_nand_flash_addr_index22:4;
        /** mem_nand_flash_req_or_cfg22 : HRO; bitpos: [10]; default: 0;
         *  MSPI NAND FLASH config reg_or_cfg at spi seq index 22. 1: AXI/APB request  0: SPI
         *  SEQ configuration.
         */
        uint32_t mem_nand_flash_req_or_cfg22:1;
        /** mem_nand_flash_cmd_index22 : HRO; bitpos: [14:11]; default: 0;
         *  MSPI NAND FLASH config spi_cmd_index at spi seq index 22. Use to find SPI command
         *  in CMD LUT.(Note these registers are described to indicate the
         *  spi_mem_c_NAND_FLASH_SPI_SEQ_REG' fieldd The number of CMD LUT entries can be defined
         *  by the user, but cannot exceed 16 )
         */
        uint32_t mem_nand_flash_cmd_index22:4;
        uint32_t reserved_15:17;
    };
    uint32_t val;
} spi_mem_c_nand_flash_spi_seq22_reg_t;

/** Type of mem_nand_flash_spi_seq23 register
 *  NAND FLASH SPI SEQ control register
 */
typedef union {
    struct {
        /** mem_nand_flash_seq_tail_flg23 : HRO; bitpos: [0]; default: 0;
         *  MSPI NAND FLASH config seq_tail_flg at spi seq index 23.1: The last index for
         *  sequence. 0: Not the last index.
         */
        uint32_t mem_nand_flash_seq_tail_flg23:1;
        /** mem_nand_flash_sr_chk_en23 : HRO; bitpos: [1]; default: 0;
         *  MSPI NAND FLASH config sr_chk_en at spi seq index 23. 1: enable 0: disable.
         */
        uint32_t mem_nand_flash_sr_chk_en23:1;
        /** mem_nand_flash_din_index23 : HRO; bitpos: [5:2]; default: 0;
         *  MSPI NAND FLASH config din_index at spi seq index 23.  Use with
         *  spi_mem_c_NAND_FLASH_CFG_DATA
         */
        uint32_t mem_nand_flash_din_index23:4;
        /** mem_nand_flash_addr_index23 : HRO; bitpos: [9:6]; default: 0;
         *  MSPI NAND FLASH config addr_index at spi seq index 23.  Use with
         *  spi_mem_c_NAND_FLASH_SR_ADDR
         */
        uint32_t mem_nand_flash_addr_index23:4;
        /** mem_nand_flash_req_or_cfg23 : HRO; bitpos: [10]; default: 0;
         *  MSPI NAND FLASH config reg_or_cfg at spi seq index 23. 1: AXI/APB request  0: SPI
         *  SEQ configuration.
         */
        uint32_t mem_nand_flash_req_or_cfg23:1;
        /** mem_nand_flash_cmd_index23 : HRO; bitpos: [14:11]; default: 0;
         *  MSPI NAND FLASH config spi_cmd_index at spi seq index 23. Use to find SPI command
         *  in CMD LUT.(Note these registers are described to indicate the
         *  spi_mem_c_NAND_FLASH_SPI_SEQ_REG' fieldd The number of CMD LUT entries can be defined
         *  by the user, but cannot exceed 16 )
         */
        uint32_t mem_nand_flash_cmd_index23:4;
        uint32_t reserved_15:17;
    };
    uint32_t val;
} spi_mem_c_nand_flash_spi_seq23_reg_t;

/** Type of mem_nand_flash_spi_seq24 register
 *  NAND FLASH SPI SEQ control register
 */
typedef union {
    struct {
        /** mem_nand_flash_seq_tail_flg24 : HRO; bitpos: [0]; default: 0;
         *  MSPI NAND FLASH config seq_tail_flg at spi seq index 24.1: The last index for
         *  sequence. 0: Not the last index.
         */
        uint32_t mem_nand_flash_seq_tail_flg24:1;
        /** mem_nand_flash_sr_chk_en24 : HRO; bitpos: [1]; default: 0;
         *  MSPI NAND FLASH config sr_chk_en at spi seq index 24. 1: enable 0: disable.
         */
        uint32_t mem_nand_flash_sr_chk_en24:1;
        /** mem_nand_flash_din_index24 : HRO; bitpos: [5:2]; default: 0;
         *  MSPI NAND FLASH config din_index at spi seq index 24.  Use with
         *  spi_mem_c_NAND_FLASH_CFG_DATA
         */
        uint32_t mem_nand_flash_din_index24:4;
        /** mem_nand_flash_addr_index24 : HRO; bitpos: [9:6]; default: 0;
         *  MSPI NAND FLASH config addr_index at spi seq index 24.  Use with
         *  spi_mem_c_NAND_FLASH_SR_ADDR
         */
        uint32_t mem_nand_flash_addr_index24:4;
        /** mem_nand_flash_req_or_cfg24 : HRO; bitpos: [10]; default: 0;
         *  MSPI NAND FLASH config reg_or_cfg at spi seq index 24. 1: AXI/APB request  0: SPI
         *  SEQ configuration.
         */
        uint32_t mem_nand_flash_req_or_cfg24:1;
        /** mem_nand_flash_cmd_index24 : HRO; bitpos: [14:11]; default: 0;
         *  MSPI NAND FLASH config spi_cmd_index at spi seq index 24. Use to find SPI command
         *  in CMD LUT.(Note these registers are described to indicate the
         *  spi_mem_c_NAND_FLASH_SPI_SEQ_REG' fieldd The number of CMD LUT entries can be defined
         *  by the user, but cannot exceed 16 )
         */
        uint32_t mem_nand_flash_cmd_index24:4;
        uint32_t reserved_15:17;
    };
    uint32_t val;
} spi_mem_c_nand_flash_spi_seq24_reg_t;

/** Type of mem_nand_flash_spi_seq25 register
 *  NAND FLASH SPI SEQ control register
 */
typedef union {
    struct {
        /** mem_nand_flash_seq_tail_flg25 : HRO; bitpos: [0]; default: 0;
         *  MSPI NAND FLASH config seq_tail_flg at spi seq index 25.1: The last index for
         *  sequence. 0: Not the last index.
         */
        uint32_t mem_nand_flash_seq_tail_flg25:1;
        /** mem_nand_flash_sr_chk_en25 : HRO; bitpos: [1]; default: 0;
         *  MSPI NAND FLASH config sr_chk_en at spi seq index 25. 1: enable 0: disable.
         */
        uint32_t mem_nand_flash_sr_chk_en25:1;
        /** mem_nand_flash_din_index25 : HRO; bitpos: [5:2]; default: 0;
         *  MSPI NAND FLASH config din_index at spi seq index 25.  Use with
         *  spi_mem_c_NAND_FLASH_CFG_DATA
         */
        uint32_t mem_nand_flash_din_index25:4;
        /** mem_nand_flash_addr_index25 : HRO; bitpos: [9:6]; default: 0;
         *  MSPI NAND FLASH config addr_index at spi seq index 25.  Use with
         *  spi_mem_c_NAND_FLASH_SR_ADDR
         */
        uint32_t mem_nand_flash_addr_index25:4;
        /** mem_nand_flash_req_or_cfg25 : HRO; bitpos: [10]; default: 0;
         *  MSPI NAND FLASH config reg_or_cfg at spi seq index 25. 1: AXI/APB request  0: SPI
         *  SEQ configuration.
         */
        uint32_t mem_nand_flash_req_or_cfg25:1;
        /** mem_nand_flash_cmd_index25 : HRO; bitpos: [14:11]; default: 0;
         *  MSPI NAND FLASH config spi_cmd_index at spi seq index 25. Use to find SPI command
         *  in CMD LUT.(Note these registers are described to indicate the
         *  spi_mem_c_NAND_FLASH_SPI_SEQ_REG' fieldd The number of CMD LUT entries can be defined
         *  by the user, but cannot exceed 16 )
         */
        uint32_t mem_nand_flash_cmd_index25:4;
        uint32_t reserved_15:17;
    };
    uint32_t val;
} spi_mem_c_nand_flash_spi_seq25_reg_t;

/** Type of mem_nand_flash_spi_seq26 register
 *  NAND FLASH SPI SEQ control register
 */
typedef union {
    struct {
        /** mem_nand_flash_seq_tail_flg26 : HRO; bitpos: [0]; default: 0;
         *  MSPI NAND FLASH config seq_tail_flg at spi seq index 26.1: The last index for
         *  sequence. 0: Not the last index.
         */
        uint32_t mem_nand_flash_seq_tail_flg26:1;
        /** mem_nand_flash_sr_chk_en26 : HRO; bitpos: [1]; default: 0;
         *  MSPI NAND FLASH config sr_chk_en at spi seq index 26. 1: enable 0: disable.
         */
        uint32_t mem_nand_flash_sr_chk_en26:1;
        /** mem_nand_flash_din_index26 : HRO; bitpos: [5:2]; default: 0;
         *  MSPI NAND FLASH config din_index at spi seq index 26.  Use with
         *  spi_mem_c_NAND_FLASH_CFG_DATA
         */
        uint32_t mem_nand_flash_din_index26:4;
        /** mem_nand_flash_addr_index26 : HRO; bitpos: [9:6]; default: 0;
         *  MSPI NAND FLASH config addr_index at spi seq index 26.  Use with
         *  spi_mem_c_NAND_FLASH_SR_ADDR
         */
        uint32_t mem_nand_flash_addr_index26:4;
        /** mem_nand_flash_req_or_cfg26 : HRO; bitpos: [10]; default: 0;
         *  MSPI NAND FLASH config reg_or_cfg at spi seq index 26. 1: AXI/APB request  0: SPI
         *  SEQ configuration.
         */
        uint32_t mem_nand_flash_req_or_cfg26:1;
        /** mem_nand_flash_cmd_index26 : HRO; bitpos: [14:11]; default: 0;
         *  MSPI NAND FLASH config spi_cmd_index at spi seq index 26. Use to find SPI command
         *  in CMD LUT.(Note these registers are described to indicate the
         *  spi_mem_c_NAND_FLASH_SPI_SEQ_REG' fieldd The number of CMD LUT entries can be defined
         *  by the user, but cannot exceed 16 )
         */
        uint32_t mem_nand_flash_cmd_index26:4;
        uint32_t reserved_15:17;
    };
    uint32_t val;
} spi_mem_c_nand_flash_spi_seq26_reg_t;

/** Type of mem_nand_flash_spi_seq27 register
 *  NAND FLASH SPI SEQ control register
 */
typedef union {
    struct {
        /** mem_nand_flash_seq_tail_flg27 : HRO; bitpos: [0]; default: 0;
         *  MSPI NAND FLASH config seq_tail_flg at spi seq index 27.1: The last index for
         *  sequence. 0: Not the last index.
         */
        uint32_t mem_nand_flash_seq_tail_flg27:1;
        /** mem_nand_flash_sr_chk_en27 : HRO; bitpos: [1]; default: 0;
         *  MSPI NAND FLASH config sr_chk_en at spi seq index 27. 1: enable 0: disable.
         */
        uint32_t mem_nand_flash_sr_chk_en27:1;
        /** mem_nand_flash_din_index27 : HRO; bitpos: [5:2]; default: 0;
         *  MSPI NAND FLASH config din_index at spi seq index 27.  Use with
         *  spi_mem_c_NAND_FLASH_CFG_DATA
         */
        uint32_t mem_nand_flash_din_index27:4;
        /** mem_nand_flash_addr_index27 : HRO; bitpos: [9:6]; default: 0;
         *  MSPI NAND FLASH config addr_index at spi seq index 27.  Use with
         *  spi_mem_c_NAND_FLASH_SR_ADDR
         */
        uint32_t mem_nand_flash_addr_index27:4;
        /** mem_nand_flash_req_or_cfg27 : HRO; bitpos: [10]; default: 0;
         *  MSPI NAND FLASH config reg_or_cfg at spi seq index 27. 1: AXI/APB request  0: SPI
         *  SEQ configuration.
         */
        uint32_t mem_nand_flash_req_or_cfg27:1;
        /** mem_nand_flash_cmd_index27 : HRO; bitpos: [14:11]; default: 0;
         *  MSPI NAND FLASH config spi_cmd_index at spi seq index 27. Use to find SPI command
         *  in CMD LUT.(Note these registers are described to indicate the
         *  spi_mem_c_NAND_FLASH_SPI_SEQ_REG' fieldd The number of CMD LUT entries can be defined
         *  by the user, but cannot exceed 16 )
         */
        uint32_t mem_nand_flash_cmd_index27:4;
        uint32_t reserved_15:17;
    };
    uint32_t val;
} spi_mem_c_nand_flash_spi_seq27_reg_t;

/** Type of mem_nand_flash_spi_seq28 register
 *  NAND FLASH SPI SEQ control register
 */
typedef union {
    struct {
        /** mem_nand_flash_seq_tail_flg28 : HRO; bitpos: [0]; default: 0;
         *  MSPI NAND FLASH config seq_tail_flg at spi seq index 28.1: The last index for
         *  sequence. 0: Not the last index.
         */
        uint32_t mem_nand_flash_seq_tail_flg28:1;
        /** mem_nand_flash_sr_chk_en28 : HRO; bitpos: [1]; default: 0;
         *  MSPI NAND FLASH config sr_chk_en at spi seq index 28. 1: enable 0: disable.
         */
        uint32_t mem_nand_flash_sr_chk_en28:1;
        /** mem_nand_flash_din_index28 : HRO; bitpos: [5:2]; default: 0;
         *  MSPI NAND FLASH config din_index at spi seq index 28.  Use with
         *  spi_mem_c_NAND_FLASH_CFG_DATA
         */
        uint32_t mem_nand_flash_din_index28:4;
        /** mem_nand_flash_addr_index28 : HRO; bitpos: [9:6]; default: 0;
         *  MSPI NAND FLASH config addr_index at spi seq index 28.  Use with
         *  spi_mem_c_NAND_FLASH_SR_ADDR
         */
        uint32_t mem_nand_flash_addr_index28:4;
        /** mem_nand_flash_req_or_cfg28 : HRO; bitpos: [10]; default: 0;
         *  MSPI NAND FLASH config reg_or_cfg at spi seq index 28. 1: AXI/APB request  0: SPI
         *  SEQ configuration.
         */
        uint32_t mem_nand_flash_req_or_cfg28:1;
        /** mem_nand_flash_cmd_index28 : HRO; bitpos: [14:11]; default: 0;
         *  MSPI NAND FLASH config spi_cmd_index at spi seq index 28. Use to find SPI command
         *  in CMD LUT.(Note these registers are described to indicate the
         *  spi_mem_c_NAND_FLASH_SPI_SEQ_REG' fieldd The number of CMD LUT entries can be defined
         *  by the user, but cannot exceed 16 )
         */
        uint32_t mem_nand_flash_cmd_index28:4;
        uint32_t reserved_15:17;
    };
    uint32_t val;
} spi_mem_c_nand_flash_spi_seq28_reg_t;

