espressif/esp-idf/components/soc/esp32h21/register/soc/spi_mem_c_struct.h
/** Type of mem_nand_flash_spi_seq29 register
 *  NAND FLASH SPI SEQ control register
 */
typedef union {
    struct {
        /** mem_nand_flash_seq_tail_flg29 : HRO; bitpos: [0]; default: 0;
         *  MSPI NAND FLASH config seq_tail_flg at spi seq index 29.1: The last index for
         *  sequence. 0: Not the last index.
         */
        uint32_t mem_nand_flash_seq_tail_flg29:1;
        /** mem_nand_flash_sr_chk_en29 : HRO; bitpos: [1]; default: 0;
         *  MSPI NAND FLASH config sr_chk_en at spi seq index 29. 1: enable 0: disable.
         */
        uint32_t mem_nand_flash_sr_chk_en29:1;
        /** mem_nand_flash_din_index29 : HRO; bitpos: [5:2]; default: 0;
         *  MSPI NAND FLASH config din_index at spi seq index 29.  Use with
         *  spi_mem_c_NAND_FLASH_CFG_DATA
         */
        uint32_t mem_nand_flash_din_index29:4;
        /** mem_nand_flash_addr_index29 : HRO; bitpos: [9:6]; default: 0;
         *  MSPI NAND FLASH config addr_index at spi seq index 29.  Use with
         *  spi_mem_c_NAND_FLASH_SR_ADDR
         */
        uint32_t mem_nand_flash_addr_index29:4;
        /** mem_nand_flash_req_or_cfg29 : HRO; bitpos: [10]; default: 0;
         *  MSPI NAND FLASH config reg_or_cfg at spi seq index 29. 1: AXI/APB request  0: SPI
         *  SEQ configuration.
         */
        uint32_t mem_nand_flash_req_or_cfg29:1;
        /** mem_nand_flash_cmd_index29 : HRO; bitpos: [14:11]; default: 0;
         *  MSPI NAND FLASH config spi_cmd_index at spi seq index 29. Use to find SPI command
         *  in CMD LUT.(Note these registers are described to indicate the
         *  spi_mem_c_NAND_FLASH_SPI_SEQ_REG' fieldd The number of CMD LUT entries can be defined
         *  by the user, but cannot exceed 16 )
         */
        uint32_t mem_nand_flash_cmd_index29:4;
        uint32_t reserved_15:17;
    };
    uint32_t val;
} spi_mem_c_nand_flash_spi_seq29_reg_t;

/** Type of mem_nand_flash_spi_seq30 register
 *  NAND FLASH SPI SEQ control register
 */
typedef union {
    struct {
        /** mem_nand_flash_seq_tail_flg30 : HRO; bitpos: [0]; default: 0;
         *  MSPI NAND FLASH config seq_tail_flg at spi seq index 30.1: The last index for
         *  sequence. 0: Not the last index.
         */
        uint32_t mem_nand_flash_seq_tail_flg30:1;
        /** mem_nand_flash_sr_chk_en30 : HRO; bitpos: [1]; default: 0;
         *  MSPI NAND FLASH config sr_chk_en at spi seq index 30. 1: enable 0: disable.
         */
        uint32_t mem_nand_flash_sr_chk_en30:1;
        /** mem_nand_flash_din_index30 : HRO; bitpos: [5:2]; default: 0;
         *  MSPI NAND FLASH config din_index at spi seq index 30.  Use with
         *  spi_mem_c_NAND_FLASH_CFG_DATA
         */
        uint32_t mem_nand_flash_din_index30:4;
        /** mem_nand_flash_addr_index30 : HRO; bitpos: [9:6]; default: 0;
         *  MSPI NAND FLASH config addr_index at spi seq index 30.  Use with
         *  spi_mem_c_NAND_FLASH_SR_ADDR
         */
        uint32_t mem_nand_flash_addr_index30:4;
        /** mem_nand_flash_req_or_cfg30 : HRO; bitpos: [10]; default: 0;
         *  MSPI NAND FLASH config reg_or_cfg at spi seq index 30. 1: AXI/APB request  0: SPI
         *  SEQ configuration.
         */
        uint32_t mem_nand_flash_req_or_cfg30:1;
        /** mem_nand_flash_cmd_index30 : HRO; bitpos: [14:11]; default: 0;
         *  MSPI NAND FLASH config spi_cmd_index at spi seq index 30. Use to find SPI command
         *  in CMD LUT.(Note these registers are described to indicate the
         *  spi_mem_c_NAND_FLASH_SPI_SEQ_REG' fieldd The number of CMD LUT entries can be defined
         *  by the user, but cannot exceed 16 )
         */
        uint32_t mem_nand_flash_cmd_index30:4;
        uint32_t reserved_15:17;
    };
    uint32_t val;
} spi_mem_c_nand_flash_spi_seq30_reg_t;

/** Type of mem_nand_flash_spi_seq31 register
 *  NAND FLASH SPI SEQ control register
 */
typedef union {
    struct {
        /** mem_nand_flash_seq_tail_flg31 : HRO; bitpos: [0]; default: 0;
         *  MSPI NAND FLASH config seq_tail_flg at spi seq index 31.1: The last index for
         *  sequence. 0: Not the last index.
         */
        uint32_t mem_nand_flash_seq_tail_flg31:1;
        /** mem_nand_flash_sr_chk_en31 : HRO; bitpos: [1]; default: 0;
         *  MSPI NAND FLASH config sr_chk_en at spi seq index 31. 1: enable 0: disable.
         */
        uint32_t mem_nand_flash_sr_chk_en31:1;
        /** mem_nand_flash_din_index31 : HRO; bitpos: [5:2]; default: 0;
         *  MSPI NAND FLASH config din_index at spi seq index 31.  Use with
         *  spi_mem_c_NAND_FLASH_CFG_DATA
         */
        uint32_t mem_nand_flash_din_index31:4;
        /** mem_nand_flash_addr_index31 : HRO; bitpos: [9:6]; default: 0;
         *  MSPI NAND FLASH config addr_index at spi seq index 31.  Use with
         *  spi_mem_c_NAND_FLASH_SR_ADDR
         */
        uint32_t mem_nand_flash_addr_index31:4;
        /** mem_nand_flash_req_or_cfg31 : HRO; bitpos: [10]; default: 0;
         *  MSPI NAND FLASH config reg_or_cfg at spi seq index 31. 1: AXI/APB request  0: SPI
         *  SEQ configuration.
         */
        uint32_t mem_nand_flash_req_or_cfg31:1;
        /** mem_nand_flash_cmd_index31 : HRO; bitpos: [14:11]; default: 0;
         *  MSPI NAND FLASH config spi_cmd_index at spi seq index 31. Use to find SPI command
         *  in CMD LUT.(Note these registers are described to indicate the
         *  spi_mem_c_NAND_FLASH_SPI_SEQ_REG' fieldd The number of CMD LUT entries can be defined
         *  by the user, but cannot exceed 16 )
         */
        uint32_t mem_nand_flash_cmd_index31:4;
        uint32_t reserved_15:17;
    };
    uint32_t val;
} spi_mem_c_nand_flash_spi_seq31_reg_t;


/** Group: Manual Encryption plaintext Memory */
/** Type of mem_xts_plain_base register
 *  The base address of the memory that stores plaintext in Manual Encryption
 */
typedef union {
    struct {
        /** xts_plain : R/W; bitpos: [31:0]; default: 0;
         *  This field is only used to generate include file in c case. This field is useless.
         *  Please do not use this field.
         */
        uint32_t xts_plain:32;
    };
    uint32_t val;
} spi_mem_c_xts_plain_base_reg_t;


/** Group: Manual Encryption configuration registers */
/** Type of mem_xts_linesize register
 *  Manual Encryption Line-Size register
 */
typedef union {
    struct {
        /** xts_linesize : R/W; bitpos: [1:0]; default: 0;
         *  This bits stores the line-size parameter which will be used in manual encryption
         *  calculation. It decides how many bytes will be encrypted one time. 0: 16-bytes, 1:
         *  32-bytes, 2: 64-bytes, 3:reserved.
         */
        uint32_t xts_linesize:2;
        uint32_t reserved_2:30;
    };
    uint32_t val;
} spi_mem_c_xts_linesize_reg_t;

/** Type of mem_xts_destination register
 *  Manual Encryption destination register
 */
typedef union {
    struct {
        /** xts_destination : R/W; bitpos: [0]; default: 0;
         *  This bit stores the destination parameter which will be used in manual encryption
         *  calculation. 0: flash(default), 1: psram(reserved). Only default value can be used.
         */
        uint32_t xts_destination:1;
        uint32_t reserved_1:31;
    };
    uint32_t val;
} spi_mem_c_xts_destination_reg_t;

/** Type of mem_xts_physical_address register
 *  Manual Encryption physical address register
 */
typedef union {
    struct {
        /** xts_physical_address : R/W; bitpos: [29:0]; default: 0;
         *  This bits stores the physical-address parameter which will be used in manual
         *  encryption calculation. This value should aligned with byte number decided by
         *  line-size parameter.
         */
        uint32_t xts_physical_address:30;
        uint32_t reserved_30:2;
    };
    uint32_t val;
} spi_mem_c_xts_physical_address_reg_t;


/** Group: Manual Encryption control and status registers */
/** Type of mem_xts_trigger register
 *  Manual Encryption physical address register
 */
typedef union {
    struct {
        /** xts_trigger : WT; bitpos: [0]; default: 0;
         *  Set this bit to trigger the process of manual encryption calculation. This action
         *  should only be asserted when manual encryption status is 0. After this action,
         *  manual encryption status becomes 1. After calculation is done, manual encryption
         *  status becomes 2.
         */
        uint32_t xts_trigger:1;
        uint32_t reserved_1:31;
    };
    uint32_t val;
} spi_mem_c_xts_trigger_reg_t;

/** Type of mem_xts_release register
 *  Manual Encryption physical address register
 */
typedef union {
    struct {
        /** xts_release : WT; bitpos: [0]; default: 0;
         *  Set this bit to release encrypted result to mspi. This action should only be
         *  asserted when manual encryption status is 2. After this action, manual encryption
         *  status will become 3.
         */
        uint32_t xts_release:1;
        uint32_t reserved_1:31;
    };
    uint32_t val;
} spi_mem_c_xts_release_reg_t;

