espressif/esp-idf/components/soc/esp32h21/register/soc/spi_mem_c_struct.h
typedef struct {
    volatile spi_mem_c_cmd_reg_t cmd;
    volatile spi_mem_c_addr_reg_t addr;
    volatile spi_mem_c_ctrl_reg_t ctrl;
    volatile spi_mem_c_ctrl1_reg_t ctrl1;
    volatile spi_mem_c_ctrl2_reg_t ctrl2;
    volatile spi_mem_c_clock_reg_t clock;
    volatile spi_mem_c_user_reg_t user;
    volatile spi_mem_c_user1_reg_t user1;
    volatile spi_mem_c_user2_reg_t user2;
    uint32_t reserved_024[4];
    volatile spi_mem_c_misc_reg_t mem_misc;
    uint32_t reserved_038;
    volatile spi_mem_c_cache_fctrl_reg_t mem_cache_fctrl;
    uint32_t reserved_040;
    volatile spi_mem_c_sram_cmd_reg_t mem_sram_cmd;
    uint32_t reserved_048[3];
    volatile spi_mem_c_fsm_reg_t mem_fsm;
    uint32_t reserved_058[26];
    volatile spi_mem_c_int_ena_reg_t mem_int_ena;
    volatile spi_mem_c_int_clr_reg_t mem_int_clr;
    volatile spi_mem_c_int_raw_reg_t mem_int_raw;
    volatile spi_mem_c_int_st_reg_t mem_int_st;
    uint32_t reserved_0d0;
    volatile spi_mem_c_ddr_reg_t mem_ddr;
    volatile spi_smem_ddr_reg_t smem_ddr;
    uint32_t reserved_0dc[9];
    volatile spi_fmem_c_pmsn_attr_reg_t fmem_pmsn_attr[4];
    volatile spi_fmem_c_pmsn_addr_reg_t fmem_pmsn_addr[4];
    volatile spi_fmem_c_pmsn_size_reg_t fmem_pmsn_size[4];
    volatile spi_smem_pmsn_attr_reg_t smem_pmsn_attr[4];
    volatile spi_smem_pmsn_addr_reg_t smem_pmsn_addr[4];
    volatile spi_smem_pmsn_size_reg_t smem_pmsn_size[4];
    volatile spi_mem_c_pms_reject_reg_t mem_pms_reject;
    volatile spi_mem_c_pms_reject_addr_reg_t mem_pms_reject_addr;
    volatile spi_mem_c_ecc_ctrl_reg_t mem_ecc_ctrl;
    volatile spi_mem_c_ecc_err_addr_reg_t mem_ecc_err_addr;
    volatile spi_mem_c_axi_err_addr_reg_t mem_axi_err_addr;
    volatile spi_smem_ecc_ctrl_reg_t smem_ecc_ctrl;
    volatile spi_smem_axi_addr_ctrl_reg_t smem_axi_addr_ctrl;
    volatile spi_mem_c_axi_err_resp_en_reg_t mem_axi_err_resp_en;
    volatile spi_mem_c_timing_cali_reg_t mem_timing_cali;
    volatile spi_mem_c_din_mode_reg_t mem_din_mode;
    volatile spi_mem_c_din_num_reg_t mem_din_num;
    volatile spi_mem_c_dout_mode_reg_t mem_dout_mode;
    volatile spi_smem_timing_cali_reg_t smem_timing_cali;
    volatile spi_smem_din_mode_reg_t smem_din_mode;
    volatile spi_smem_din_num_reg_t smem_din_num;
    volatile spi_smem_dout_mode_reg_t smem_dout_mode;
    volatile spi_smem_ac_reg_t smem_ac;
    uint32_t reserved_1a4[23];
    volatile spi_mem_c_clock_gate_reg_t mem_clock_gate;
    volatile spi_mem_c_nand_flash_en_reg_t mem_nand_flash_en;
    volatile spi_mem_c_nand_flash_sr_addr0_reg_t mem_nand_flash_sr_addr0;
    volatile spi_mem_c_nand_flash_sr_din0_reg_t mem_nand_flash_sr_din0;
    volatile spi_mem_c_nand_flash_cfg_data0_reg_t mem_nand_flash_cfg_data0;
    volatile spi_mem_c_nand_flash_cfg_data1_reg_t mem_nand_flash_cfg_data1;
    volatile spi_mem_c_nand_flash_cfg_data2_reg_t mem_nand_flash_cfg_data2;
    uint32_t reserved_21c[9];
    volatile spi_mem_c_nand_flash_cmd_lut0_reg_t mem_nand_flash_cmd_lut0;
    volatile spi_mem_c_nand_flash_cmd_lut1_reg_t mem_nand_flash_cmd_lut1;
    volatile spi_mem_c_nand_flash_cmd_lut2_reg_t mem_nand_flash_cmd_lut2;
    volatile spi_mem_c_nand_flash_cmd_lut3_reg_t mem_nand_flash_cmd_lut3;
    volatile spi_mem_c_nand_flash_cmd_lut4_reg_t mem_nand_flash_cmd_lut4;
    volatile spi_mem_c_nand_flash_cmd_lut5_reg_t mem_nand_flash_cmd_lut5;
    volatile spi_mem_c_nand_flash_cmd_lut6_reg_t mem_nand_flash_cmd_lut6;
    volatile spi_mem_c_nand_flash_cmd_lut7_reg_t mem_nand_flash_cmd_lut7;
    volatile spi_mem_c_nand_flash_cmd_lut8_reg_t mem_nand_flash_cmd_lut8;
    volatile spi_mem_c_nand_flash_cmd_lut9_reg_t mem_nand_flash_cmd_lut9;
    volatile spi_mem_c_nand_flash_cmd_lut10_reg_t mem_nand_flash_cmd_lut10;
    volatile spi_mem_c_nand_flash_cmd_lut11_reg_t mem_nand_flash_cmd_lut11;
    volatile spi_mem_c_nand_flash_cmd_lut12_reg_t mem_nand_flash_cmd_lut12;
    volatile spi_mem_c_nand_flash_cmd_lut13_reg_t mem_nand_flash_cmd_lut13;
    volatile spi_mem_c_nand_flash_cmd_lut14_reg_t mem_nand_flash_cmd_lut14;
    volatile spi_mem_c_nand_flash_cmd_lut15_reg_t mem_nand_flash_cmd_lut15;
    volatile spi_mem_c_nand_flash_spi_seq0_reg_t mem_nand_flash_spi_seq0;
    volatile spi_mem_c_nand_flash_spi_seq1_reg_t mem_nand_flash_spi_seq1;
    volatile spi_mem_c_nand_flash_spi_seq2_reg_t mem_nand_flash_spi_seq2;
    volatile spi_mem_c_nand_flash_spi_seq3_reg_t mem_nand_flash_spi_seq3;
    volatile spi_mem_c_nand_flash_spi_seq4_reg_t mem_nand_flash_spi_seq4;
    volatile spi_mem_c_nand_flash_spi_seq5_reg_t mem_nand_flash_spi_seq5;
    volatile spi_mem_c_nand_flash_spi_seq6_reg_t mem_nand_flash_spi_seq6;
    volatile spi_mem_c_nand_flash_spi_seq7_reg_t mem_nand_flash_spi_seq7;
    volatile spi_mem_c_nand_flash_spi_seq8_reg_t mem_nand_flash_spi_seq8;
    volatile spi_mem_c_nand_flash_spi_seq9_reg_t mem_nand_flash_spi_seq9;
    volatile spi_mem_c_nand_flash_spi_seq10_reg_t mem_nand_flash_spi_seq10;
    volatile spi_mem_c_nand_flash_spi_seq11_reg_t mem_nand_flash_spi_seq11;
    volatile spi_mem_c_nand_flash_spi_seq12_reg_t mem_nand_flash_spi_seq12;
    volatile spi_mem_c_nand_flash_spi_seq13_reg_t mem_nand_flash_spi_seq13;
    volatile spi_mem_c_nand_flash_spi_seq14_reg_t mem_nand_flash_spi_seq14;
    volatile spi_mem_c_nand_flash_spi_seq15_reg_t mem_nand_flash_spi_seq15;
    volatile spi_mem_c_nand_flash_spi_seq16_reg_t mem_nand_flash_spi_seq16;
    volatile spi_mem_c_nand_flash_spi_seq17_reg_t mem_nand_flash_spi_seq17;
    volatile spi_mem_c_nand_flash_spi_seq18_reg_t mem_nand_flash_spi_seq18;
    volatile spi_mem_c_nand_flash_spi_seq19_reg_t mem_nand_flash_spi_seq19;
    volatile spi_mem_c_nand_flash_spi_seq20_reg_t mem_nand_flash_spi_seq20;
    volatile spi_mem_c_nand_flash_spi_seq21_reg_t mem_nand_flash_spi_seq21;
    volatile spi_mem_c_nand_flash_spi_seq22_reg_t mem_nand_flash_spi_seq22;
    volatile spi_mem_c_nand_flash_spi_seq23_reg_t mem_nand_flash_spi_seq23;
    volatile spi_mem_c_nand_flash_spi_seq24_reg_t mem_nand_flash_spi_seq24;
    volatile spi_mem_c_nand_flash_spi_seq25_reg_t mem_nand_flash_spi_seq25;
    volatile spi_mem_c_nand_flash_spi_seq26_reg_t mem_nand_flash_spi_seq26;
    volatile spi_mem_c_nand_flash_spi_seq27_reg_t mem_nand_flash_spi_seq27;
    volatile spi_mem_c_nand_flash_spi_seq28_reg_t mem_nand_flash_spi_seq28;
    volatile spi_mem_c_nand_flash_spi_seq29_reg_t mem_nand_flash_spi_seq29;
    volatile spi_mem_c_nand_flash_spi_seq30_reg_t mem_nand_flash_spi_seq30;
    volatile spi_mem_c_nand_flash_spi_seq31_reg_t mem_nand_flash_spi_seq31;
    volatile spi_mem_c_xts_plain_base_reg_t mem_xts_plain_base;
    uint32_t reserved_304[15];
    volatile spi_mem_c_xts_linesize_reg_t mem_xts_linesize;
    volatile spi_mem_c_xts_destination_reg_t mem_xts_destination;
    volatile spi_mem_c_xts_physical_address_reg_t mem_xts_physical_address;
    volatile spi_mem_c_xts_trigger_reg_t mem_xts_trigger;
    volatile spi_mem_c_xts_release_reg_t mem_xts_release;
    volatile spi_mem_c_xts_destroy_reg_t mem_xts_destroy;
    volatile spi_mem_c_xts_state_reg_t mem_xts_state;
    volatile spi_mem_c_xts_date_reg_t mem_xts_date;
    uint32_t reserved_360[7];
    volatile spi_mem_c_mmu_item_content_reg_t mem_mmu_item_content;
    volatile spi_mem_c_mmu_item_index_reg_t mem_mmu_item_index;
    volatile spi_mem_c_mmu_power_ctrl_reg_t mem_mmu_power_ctrl;
    volatile spi_mem_c_dpa_ctrl_reg_t mem_dpa_ctrl;
    volatile spi_mem_c_xts_pseudo_round_conf_reg_t mem_xts_pseudo_round_conf;
    uint32_t reserved_390[27];
    volatile spi_mem_c_date_reg_t mem_date;
} spi_mem_c_dev_t;


#ifndef __cplusplus
_Static_assert(sizeof(spi_mem_c_dev_t) == 0x400, "Invalid size of spi_mem_c_dev_t structure");
#endif

#ifdef __cplusplus
}
#endif
